{
  
  "sections": [
    {
      "title": "Software Engineer",
      "start": "Nov 2022",
      "end": "July 2025",
      "institution": "Propylon",
      "location": "Dublin, Ireland",
      "type": "work",
      "content": [
        "Developed a conversational Retrieval-Augmented Generation (RAG) system using LangGraph and Claude Sonnet LLM, providing accurate, context-aware answers to complex legal research queries.",
        "Designed and implemented a custom indexing and retrieval algorithm integrated with OpenSearch, significantly improving semantic search precision and retrieval performance.",
        "Engineered dynamic query understanding, enabling the system to extract entities and filters from user input to narrow document search space and improve retrieval precision.",
        "Built intelligent query rewriting and source document reranking to maximize response accuracy and relevance.",
        "Applied Guardrails to enforce output safety, prevent hallucinations, and maintain strict response formats.",
        "Developed ML model to classify laws using Zero-shot classification.",
        "Designed and built a comprehensive system to generate an interactive timeline of laws and regulations by processing structured legal data from XML files, leveraging NLP, machine learning, and custom frameworks.",
        "Developed custom NLP pipelines to extract and classify legal entities, events, and relationships from unstructured text.",
        "Automated the entire pipeline using GitHub Actions for CI/CD, enabling smooth updates and reproducibility.",
        "Deployed the system and models to AWS Cloud for scalable, production ready performance.",
        "Mentored Trinity College students on AI proof-of-concept projects for internship (SWEng Program) for three years.",
        "Volunteered to teach math and programming to third-grade students at The Good Shepherd National School (Time To Count Program)."
      ]
    },
     {
      "title": "Machine Learning Engineer",
      "start": "Feb 2022",
      "end": "June 2022",
      "institution": "Ultrasound Ireland",
      "location": "Dublin, Ireland",
      "type": "work",
      "content": [
        "OCR to automate data entry of Hospital form Information into SQL.",
        "Trained YOLO V5 model to recognize special marking techniques on the form.",
        "Custom Trained Azure Form Recognizer for frequent form for high accuracy.",
        "Ensemble AWS Textract, Azure custom trained Form Recognizer model and transferred learned YOLO V5.",
        "Used open-source Tesseract to classify forms to select from Azure and AWS.",
        "Created API for the product."
      ]
    },
    {
      "title": "Master of Science in Data Analytics",
      "institution": "National College of Ireland",
      "location": "Dublin, Ireland",
      "start": "Sep 2021",
      "end": "Oct 2022",
      "type": "study",
      "content": [
        "Degree obtained October 2022",
        "Graduated with First Class Honors (1:1).",
        "Build ML Framework for predicting Empathy using eye tracking and Pupil Dilation for thesis.",
        "Included in the Dean’s Honor’s List for academic excellence.",
        "ENFUSE Competition - 3rd Position - (Inter-College Level) and Winner (College Level)."
      ]
    },
   {
      "title": "Data Scientist | GS Lab| Pune",
      "start": "Dec 2019",
      "end": "Aug 2021",
      "institution": "GS Lab",
      "location": "Pune, India",
      "type": "work",
      "content": [
        "Worked closely with IBM Watson AIOps research team.",
        "Trained and fine-tuned AIOps model on various client data on IBM cloud.",
        "Lead the team in building Network Intrusion Detection System using ML. - Model was trained on eight different cyber-attacks data.",
        "Trained on various ML models like RandomForest, XGBoost, SVM, Logistic regression etc. with thorough hyperparameter tuning.",
        "Build an application for detecting real-time network intrusion detection.",
        "Build an Anomaly detection system for IoT devices.",
        "Analyzed the data and its statistical properties.",
        "Applied various models like holt winter, SARIMA, GRU, and LSTM.",
        "Created stacked LSTM model which showed the highest accuracy.",
        "Led a team of four to build a multi-threaded RFID-to-IBM Cloud system enabling remote device control and real-time storage of EPC, TID, and user memory data."
      ]
    },
    {
      "title": "Data Scientist | Cognizant | Pune",
      "start": "Feb 2021",
      "end": "Nov 2021",
      "institution": "Cognizant",
      "location": "Pune, India",
      "type": "work",
      "content": [
        "Worked for a Banking client.",
        "Created interactive data visualizations and dashboards in Power BI to support data-driven insights and decision-making.",
        "Created backend API for data extraction from Hive Database and upstream applications.",
        "A/B testing of models."
      ]
    },
    {
      "title": "QA Automation Engineer | Cognizant | Pune",
      "start": "Nov 2019",
      "end": "Feb 2021",
      "institution": "Cognizant",
      "location": "Pune, India",
      "type": "work",
      "content": [
        "Handled multiple projects for testing for a Banking client.",
        "Created end-to-end generic Regression Script for testing API and data using Python and input data via MS Excel which tests data on the various levels depending on parameters provided in MS Excel. ",
        "Automated all testing scenarios at the end of each release using Python and ROBOT Framework.",
        "Responsible for QA signoff for multiple applications within the project.",
        "Represented the RBC project in the Innovation competition (had built Automated test-case documentation using Python)."
      ]
    },
    {
      "title": "Bachelor of Engineering, Mechanical Engineering",
      "institution": "University of Pune",
      "location": "Pune, India",
      "start": "July 2012",
      "end": "June 2016",
      "type": "study",
      "content": [
        "Degree obtained July 2016",
        "Graduated with First Class with Distinction.",
        "Designed and Build Compressed Air Engine."
      ]
    }
  ],
  "Personal Projects":
    {
      "content": [
        "ML Framework for predicting Empathy using eye tracking and Pupil Dilation (Aug 2022)",
        "Developed a machine learning framework to predict empathy using eye-tracking and pupil dilation data, integrating deep learning tools (ELLSEG, YOLOv5, dlib) and psychological analysis. Achieved 89% accuracy using Logistic Regression, demonstrating strong potential for applications in empathetic candidate screening.",
        "Free Canvas (Feb 2022)",
        "\tFree Canvas (Augmented Reality) is a drawing tool for children of age 2-8 where they can interact with webcam and draw figures by joining dots and improving creativity. \nFree canvas works by recognizing hand and finger points and children can pinch a dot and create a line.",
        "Agentic Chatbot (March 2021)",
        "\tDesigned and created a chatbot for personal use which can perform certain tasks on Ubuntu OS. \nThe data was made from scratch, and the model was trained on the data.\nA speech to text module from google was also used on top of the above model and it acted as a personal assistant. (Siri, Alexa etc.)",
        "Snake Game for Random Forest (Jan 2021)",
        "\tDesigned and built a snake game on Webcam's screen where you can see yourself (like a mirror) and the snake playing the game itself.\nMultiple models were trained to play the game, Random Forest gave the best accuracy, and we can see the Random Forest model playing the game. (It's addictive watching it). \nData for training the model was generated from scratch by playing 100 games manually."
      ]
    },
    "Skills":
    {
      "content": [
        "Python (Programming Language), Natural Language Processing (NLP), Artificial Intelligence (AI), Generative Artificial Intelligence, LangGraph (Gen AI), Image Processing, Prompt Engineering, Transformers, Django, Huggingface, Redis, FAISS, Postgres, Memory Store, OpenSearch, Github, Localstack, LXML, Terraform, Docker, Make, AWS, AWS Lambda, Machine Learning, Retrieval-Augmented Generation (RAG), Semantic Search, YOLO, Confluence, Jira, Hive, Pyspark, scikit, sklearn, XGBoost, Deep learning, Data Science, Computer Vision, Pandas, SQL, MS Excel, Java, Seaborn, Jenkins, Ubuntu, Linux, WSL, JSON, XML, spacy, beautifulSoup, matplotlib, HTML, numpy, linear regression, logistic regression, PCA, CNN, Random Forest, Request, Pattern recognition, regex, data cleaning, data extraction, neural network, ROC, MYSQL, OOP, github workflows, github actions, unit test, scenario tests, pytest, tmux."
      ]
    },
  "About":
    {
      "content": [
        "I play with code and AI to build smart, meaningful solutions. I'm a technophile at heart and a passionate learner with 7.5+ years of experience as a Data Scientist, AI Engineer, Software Engineer, Data Engineer. I aspire to be a philanthropist — using technology to improve lives, especially for children, and to drive positive, lasting impact through innovation."
      ]
    },
    "Contact":
    {
      "Email": "akshaysayar@gmail.com",
      "Phone": "+353899666388",
      "LinkedIn": "https://www.linkedin.com/in/akshay-sayar/",
      "GitHub": "https://github.com/akshaysayar",
      "Address": "63, Block 2, O'Neill Court, Dublin 13"
    }
}